docs/test/results/20260321/k6-knee/comment-vus200.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 45s max duration (incl. graceful stop):
              * default: 200 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 200/200 VUs, 451 complete and 0 interrupted iterations
default   [   6% ] 200 VUs  01.0s/15s

running (02.0s), 200/200 VUs, 924 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  02.0s/15s

running (03.0s), 200/200 VUs, 1515 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  03.0s/15s

running (05.9s), 200/200 VUs, 2290 complete and 0 interrupted iterations
default   [  26% ] 200 VUs  04.0s/15s

running (06.9s), 200/200 VUs, 3186 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  05.0s/15s

running (07.9s), 200/200 VUs, 4066 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  06.0s/15s

running (08.9s), 200/200 VUs, 5001 complete and 0 interrupted iterations
default   [  46% ] 200 VUs  07.0s/15s

running (09.9s), 200/200 VUs, 5936 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  08.0s/15s

running (10.9s), 200/200 VUs, 6855 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  09.0s/15s

running (11.9s), 200/200 VUs, 7696 complete and 0 interrupted iterations
default   [  66% ] 200 VUs  10.0s/15s

running (12.9s), 200/200 VUs, 8617 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  11.0s/15s

running (13.9s), 200/200 VUs, 9493 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  12.0s/15s

running (14.9s), 200/200 VUs, 10347 complete and 0 interrupted iterations
default   [  86% ] 200 VUs  13.0s/15s

running (15.9s), 200/200 VUs, 11205 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  14.0s/15s

running (16.9s), 200/200 VUs, 12123 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12356   719.859457/s
    checks_succeeded...: 100.00% 12356 out of 12356
    checks_failed......: 0.00%   0 out of 12356

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=274.59ms min=7.11ms med=222.91ms max=2.64s p(90)=428.29ms p(95)=603.87ms p(99)=1.42s
      { expected_response:true }...: avg=274.59ms min=7.11ms med=222.91ms max=2.64s p(90)=428.29ms p(95)=603.87ms p(99)=1.42s
    http_req_failed................: 0.00%  0 out of 12356
    http_reqs......................: 12356  719.859457/s

    EXECUTION
    iteration_duration.............: avg=243.07ms min=7.2ms  med=222.36ms max=1.29s p(90)=409.6ms  p(95)=454.72ms p(99)=664ms
    iterations.....................: 12356  719.859457/s
    vus............................: 200    min=200        max=200
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 20 MB  1.1 MB/s
    data_sent......................: 1.7 MB 100 kB/s



running (17.2s), 000/200 VUs, 12356 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  15s