docs/test/results/20260321/k6-knee/comment-vus250.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 45s max duration (incl. graceful stop):
              * default: 250 looping VUs for 15s (gracefulStop: 30s)


running (00.9s), 250/250 VUs, 692 complete and 0 interrupted iterations
default   [   6% ] 250 VUs  00.9s/15s

running (01.9s), 250/250 VUs, 1569 complete and 0 interrupted iterations
default   [  13% ] 250 VUs  01.9s/15s

running (02.9s), 250/250 VUs, 2351 complete and 0 interrupted iterations
default   [  20% ] 250 VUs  02.9s/15s

running (03.9s), 250/250 VUs, 3226 complete and 0 interrupted iterations
default   [  26% ] 250 VUs  03.9s/15s

running (04.9s), 250/250 VUs, 4052 complete and 0 interrupted iterations
default   [  33% ] 250 VUs  04.9s/15s

running (05.9s), 250/250 VUs, 4903 complete and 0 interrupted iterations
default   [  40% ] 250 VUs  05.9s/15s

running (06.9s), 250/250 VUs, 5752 complete and 0 interrupted iterations
default   [  46% ] 250 VUs  06.9s/15s

running (07.9s), 250/250 VUs, 6647 complete and 0 interrupted iterations
default   [  53% ] 250 VUs  07.9s/15s

running (08.9s), 250/250 VUs, 7442 complete and 0 interrupted iterations
default   [  60% ] 250 VUs  08.9s/15s

running (09.9s), 250/250 VUs, 8079 complete and 0 interrupted iterations
default   [  66% ] 250 VUs  09.9s/15s

running (10.9s), 250/250 VUs, 8975 complete and 0 interrupted iterations
default   [  73% ] 250 VUs  10.9s/15s

running (11.9s), 250/250 VUs, 9659 complete and 0 interrupted iterations
default   [  80% ] 250 VUs  11.9s/15s

running (12.9s), 250/250 VUs, 10354 complete and 0 interrupted iterations
default   [  86% ] 250 VUs  12.9s/15s

running (13.9s), 250/250 VUs, 11260 complete and 0 interrupted iterations
default   [  93% ] 250 VUs  13.9s/15s

running (14.9s), 250/250 VUs, 12205 complete and 0 interrupted iterations
default   [ 100% ] 250 VUs  14.9s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12509   820.555185/s
    checks_succeeded...: 100.00% 12509 out of 12509
    checks_failed......: 0.00%   0 out of 12509

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=300.23ms min=9.39ms med=287.9ms  max=1.2s p(90)=473.7ms p(95)=536.67ms p(99)=729.42ms
      { expected_response:true }...: avg=300.23ms min=9.39ms med=287.9ms  max=1.2s p(90)=473.7ms p(95)=536.67ms p(99)=729.42ms
    http_req_failed................: 0.00%  0 out of 12509
    http_reqs......................: 12509  820.555185/s

    EXECUTION
    iteration_duration.............: avg=300.62ms min=9.6ms  med=288.05ms max=1.2s p(90)=473.9ms p(95)=537.09ms p(99)=729.53ms
    iterations.....................: 12509  820.555185/s
    vus............................: 250    min=250        max=250
    vus_max........................: 250    min=250        max=250

    NETWORK
    data_received..................: 20 MB  1.3 MB/s
    data_sent......................: 1.7 MB 114 kB/s



running (15.2s), 000/250 VUs, 12509 complete and 0 interrupted iterations
default ✓ [ 100% ] 250 VUs  15s